; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	thermograph2 - mode
	image4 - mode
	thermograph0 - mode
	image1 - mode
	thermograph3 - mode
	Star4 - direction
	GroundStation2 - direction
	Star0 - direction
	GroundStation1 - direction
	GroundStation3 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Planet8 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 image4)
	(calibration_target instrument0 Star0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation2)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 thermograph3)
	(supports instrument2 image1)
	(calibration_target instrument2 Star4)
	(supports instrument3 thermograph3)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 GroundStation2)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon6)
	(supports instrument4 image1)
	(supports instrument4 thermograph3)
	(calibration_target instrument4 GroundStation1)
	(supports instrument5 thermograph2)
	(calibration_target instrument5 Star0)
	(supports instrument6 image1)
	(calibration_target instrument6 GroundStation1)
	(supports instrument7 image1)
	(calibration_target instrument7 GroundStation3)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet7)
	(supports instrument8 image1)
	(supports instrument8 thermograph0)
	(calibration_target instrument8 Star0)
	(supports instrument9 image1)
	(supports instrument9 thermograph3)
	(calibration_target instrument9 GroundStation1)
	(supports instrument10 image4)
	(supports instrument10 thermograph3)
	(supports instrument10 thermograph0)
	(calibration_target instrument10 GroundStation3)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(on_board instrument10 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star4)
)
(:goal (and
	(pointing satellite0 Planet8)
	(have_image Phenomenon5 thermograph3)
	(have_image Phenomenon6 image1)
	(have_image Planet7 image1)
	(have_image Planet8 thermograph2)
))

)

; plan
1. (turn_to satellite1 groundstation2 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 groundstation2)
   goals met: 0 of 5
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 5
3. (calibrate satellite1 instrument3 groundstation2)
   added: (calibrated instrument3)
   goals met: 0 of 5
4. (turn_to satellite1 planet8 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 planet8)
   goals met: 0 of 5
5. (take_image satellite1 planet8 instrument3 thermograph2)
   added: (have_image planet8 thermograph2)
   goals met: 1 of 5
6. (turn_to satellite1 phenomenon5 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 phenomenon5)
   goals met: 1 of 5
7. (turn_to satellite0 star0 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 star0)
   goals met: 1 of 5
8. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 5
9. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 1 of 5
10. (take_image satellite1 phenomenon5 instrument3 thermograph3)
   added: (have_image phenomenon5 thermograph3)
   goals met: 2 of 5
11. (turn_to satellite0 phenomenon6 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon6)
   goals met: 2 of 5
12. (take_image satellite0 phenomenon6 instrument0 image1)
   added: (have_image phenomenon6 image1)
   goals met: 3 of 5
13. (turn_to satellite0 planet7 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 planet7)
   goals met: 3 of 5
14. (take_image satellite0 planet7 instrument0 image1)
   added: (have_image planet7 image1)
   goals met: 4 of 5
15. (turn_to satellite0 planet8 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet8)
   goals met: 5 of 5
